;---------------------------------BEGIN: EMCC\Caliset-----------------------------------------
[CALISET_DLG_102]
CAPTION=HL Calibrate Software
ID1022=Project collection
ID1023=Sel.:
ID1007=SaveAs
ID1017=Del.
ID1084=Import
ID1085=Export

ID1075=Head
ID1024=Base
ID1025=Cali.Range(mm):
ID1026=Mark.Range(mm):
ID1072=Coord.
ID1077=R.Angle
ID1079=Off.X(mm)
ID1080=Off.Y(mm)
ID1119=Galvanometer1=X
ID1120=Galvanometer2=X
ID1116=Reverse
ID1117=Reverse

ID1030=Level Cali(Select the zoom ratio and double-click to pop up the automatic calculation window)
ID1009=New Level
ID1010=Del.Level
ID1012=Test All
ID1031=TestLayer:
ID1018=Only Max Level Mark Text

ID1053=Red Cali.
ID1043=Used
ID1054=X Scale:
ID1055=Y Scale:
ID1056=X Offset(mm):
ID1057=Y Offset(mm):

ID1058=Focus
ID1065=Mirror Type:
ID1059=Type
ID1060=Ctrl Mode
ID1061=Mirr Dist(mm)
ID1082=Dist between head && worktable(mm)
ID1063=MicroAdjust(um)
ID1062=AutoFocus ratio

ID1011=Test F7
ID1037=Stop
ID1014=Para>>

ID1109=Cali Type
ID1099=Normal Cali
ID1100=Super Cali 1
ID1101=Super Cali
ID1110=Präzisionskorrekturanweisungen: 1. Wählen Sie zuerst die regelmäßige Korrektur für die Routinekorrektur aus und nehmen Sie vorläufige Anpassungen am Koordinatensystem, der Rotlichtkorrektur, der BOX-Größe und der Verformung vor. 2. Wählen Sie hochpräzise Korrektur, um Rasterpunkte zu generieren. 3. Nachdem Sie Daten mit verschiedenen Tools erhalten und verarbeitet haben, importieren Sie die Daten.
ID1114=Direkter Import von hochgenauen Korrekturdaten

ID1089=Super Cali
ID1086=Mark Matrix
ID1111=First step: Mark Matrix
ID1112=Second step: Import cali data 
ID1113=Third step: Make super cali file

ID1096=Scale
ID1027=Effective mark range
ID1097=Concave
ID1028=Test Box range(mm):
ID1091=Import Data from scnner
ID1087=Import Data from vision measurement system 
ID1016=Make super cali file
ID1139=Korrekturtabelle generieren
ID1=Ok
ID2=Cancel
ID1142 = Markierungssteuerung

[CALISET_DLG_167]
CAPTION=Import super cali data
ID1114=The file of X position：
ID1115=The file of Y position：
ID1=Ok
ID2=Cancel

[CALISET_DLG_159]
CAPTION=Save project
ID1036=The name of project is:
ID1=Ok
ID2=Cancel

[CALISET_DLG_131]
CAPTION=Marking Para
ID1032=Mark count:
ID1033=Mark V.(mm/s)
ID1034=Q Frequent(KHz)
ID1035=PowerCurrent
ID1036=Q Release(us)
ID1037=Laser off delay (us)
ID1=Ok
ID2=Cancel

[CALISET_DLG_160]
CAPTION=Set matrix mark
ID1093=Row
ID1094=Col
ID1116=Only Set
ID1=Ok
ID2=Cancel
ID1099=Punkt
ID1100=Kreuz
ID1101=Kreis

[CALISET_DLG_164]
CAPTION=Select control card
ID1098=Please select working card:
ID1=Ok
ID2=Cancel

[CALISET_STRINGTABLE]
ID0=BOX size(mm)
ID1=X zoom%
ID2=Y zoom%
ID3=X conca
ID4=Y conca
ID5=X trape
ID6=Y trape
ID7=X paral
ID8=Y paral
ID9=X+ rate%
ID10=X- rate%
ID11=Y+ rate%
ID12=Y- rate%
ID13=Para\Level
ID14=Current(A)
ID15=Power(%)
ID16=Current(%)
ID17=Pulse(ns)
ID18=Mode
ID999=Marking softwar or calibrate has been start. Please close it first!
ID1000=Marking library file is missing or damaged, please make sure the software is proper!
ID1001=Initialize control board unsuccessfully!
ID1002=configuration of Marking control board is unsuccessful!
ID1003=Please select the level to be tested!
ID1004=Operation failed, retry!
ID1005=Existed project, overwrited?	
ID1006=Calibration range mustn't be zero0!	
ID1007=Marking range mustn't be zero!
ID1008=Wrong coefficient of proportionality, calibration range must bigger than %.3f times of marking!
ID1009=Apply
ID1010=Edit
ID1011=Please select the level to be deleted!
ID1012=Delete unsuccessfully! Please remain one level at least.
ID1013=File error!
ID1014=Set the calibration data to the card unsuccessfully, retry!!	
ID1015=Version is not consistent. Begin a mandatory read?
ID1016=BOX size overstep mark range!
ID1017=BOX size can not overstep upper pole size!
ID1018=The current calibration settings have been modified.Save it?
ID1019=Read file unsuccessfully!
ID1020=Are you sure to delete this project?
ID1021=No dongle found!
ID1022=dongle found, but it's invalid!
ID1023=More than 1 valid dongle inserted!
ID1024=Failed to convert initial dongle into running dongle!
ID1025="Software license expired. Please contact customer service personnel of Han's Laser to re-apply licensed patches matching (dongle ID=%s, check code=%s)."
ID1026="D160"
ID1027="D480"
ID1028="CO2_Strong"
ID1029="CO2_Tradition"
ID1030="Mark faily!"
ID1031=BOX size can not be less than next pole size!
ID1032=Out of valid calibration range!
ID1033="f-thea Back"
ID1034="Dynamic focusing"
ID1035="Normal Back"
ID1036="BOX size must be less than value of mark range subtract %d mm while general laser mode"
ID1037="Fail to get the DOG ID saving on the card. Please check whether card has been binded"
ID1038="Fail to Import"
ID1039="Import successfully"
ID1040="Fail to Export"
ID1041="Export successfully"
ID1042="Operate unsuccessfully"
ID1043="File mismatch,error file!"
ID1044="Back 3D"
ID1045="x-coordinate file path is null!"
ID1046="y-coordinate file path is null!"
ID1047="Dog ID in card  different from the ID at the dongle"
ID1048="Card ID in card is null or length error"


;---------------------------------End: EMCC\Caliset-----------------------------------------

[error]
1=Karte nicht initialisiert oder Karte nicht gefunden!
2 = Reset fehlgeschlagen!
3 = Die Kartenversion stimmt nicht!
4 = Alarm!
6=Ausführung fehlgeschlagen!
7=Status stimmt nicht überein!
16=Zeitüberschreitung des Befehls!
17=Befehl verloren!
18=Schnittstellenaufruf asynchron!
19=Schnittstelle von einem anderen Programm belegt!
20=Überschreitung der Z-Achse oder Beschädigung der Korrekturdatei!
21=Parameter stimmen nicht überein!
23=Speicherzuweisung fehlgeschlagen!
100 = Offline-Nutzung!
101=Befehl abgebrochen!
1001 = Anschluss 1
1002 = Anschluss 2
1003 = Anschluss 3
1004 = Anschluss 4
1005 = Anschluss 5
1006 = Anschluss 6
1007 = Anschluss 7
1008 = Lasereingang nicht bereit
1009 = Lasereingabe bereit

[4]
1 = Laserübertemperatur, bitte schalten Sie den Strom aus!
2 = Laser hoher Anti-Alarm, bitte schalten Sie den Strom aus!
3 = Laser MO abnormal, bitte schalten Sie den Strom aus!
4 = Die Laserabdeckung ist geöffnet, bitte schalten Sie die Stromversorgung aus und installieren Sie die Laserabdeckung!
5 = Die Sicherheitstür ist geöffnet, bitte schließen!
6 = Der Verschluss ist abnormal geschlossen, bitte schalten Sie den Verschluss aus und überprüfen Sie den Verschluss!
7 = Der Verschluss ist nicht ungewöhnlich geöffnet, bitte schalten Sie den Strom aus und überprüfen Sie den Verschluss!
8 = Die Schutztür ist geöffnet, die Markierung ist pausiert, bitte schließen Sie die Schutztür, um mit der Markierung fortzufahren!
9 = Schutztür geöffnet, Markierung abgebrochen!
10= Alarm der Laseranlage, bitte schalten Sie den Strom aus!
11= Laserversorgungsspannung außerhalb der Reichweite, bitte schalten Sie die Stromversorgung aus!
12= Überspannungsalarm der Laserstromversorgung, bitte schalten Sie die Stromversorgung aus und überprüfen Sie die Laserleistung!
13= Unterspannungsalarm der Laserstromversorgung, bitte schalten Sie die Stromversorgung aus und überprüfen Sie die Laserleistung!
14= SPI-Laser-Übertemperaturalarm, bitte schalten Sie das Gerät aus!
15= SPI-Laser-Bereitschaftsverstärker-Überstromalarm, bitte schalten Sie den Strom aus!
16= SPI-Laserleistungsverstärker Überstromalarm, bitte schalten Sie den Strom aus!
17= SPI-Laser-Kollimationslaser-Alarm, bitte schalten Sie den Strom aus!
18= SPI-Laserretentionsalarm, bitte schalten Sie den Strom aus!
19= SPI-Laserleistungsalarm, bitte schalten Sie den Strom aus!
20= Laser unbekannt Alarm, bitte schalten Sie den Strom aus!
21= Überstromalarm bei Laserleistung, bitte schalten Sie den Strom aus!
22= Überspannungsalarm bei Laserleistung, bitte schalten Sie den Strom aus!
23= Übertemperaturalarm bei Laserleistung, bitte schalten Sie die Stromversorgung aus und überprüfen Sie die Wärmeableitungsbedingungen!
24= Die Laserleistung ist nicht eingeschaltet, bitte überprüfen Sie die Stromversorgung.
30= Negativer Grenzwert wird während der Bewegung erreicht, Markierung wird abgebrochen!
31= Wenn während der Bewegung ein positiver Grenzwert erreicht wird, wird die Markierung abgebrochen!
32= Motorimpuls außerhalb des zulässigen Bereichs
33= Galvanometer DA außer Reichweite!
34= Plattform X-Achse Super Positive Grenze!
35= Plattform X-Achse über negativer Grenze!
36= Plattform Y-Achse super positive Grenze!
37= Plattform Y-Achse über negativer Grenze!
38= Der quadratische Galvanometerkopf wird abnormal mit Strom versorgt, bitte schalten Sie die Stromversorgung aus und überprüfen Sie!
54=Bitte auf die Korrekturtabelle 512 umschalten!
55=Bitte auf die Korrekturtabelle 128 umschalten!
100 = Die Schutztür ist gültig und geöffnet!

110 = Erreichen eines negativen Limits!
111 = Erreichen einer positiven Grenze!
112 = Triff den Ursprung in Bewegung!
500=Galvanometer wird warm, bitte versuchen Sie es später noch einmal!

[door]
1=Die Sicherheitstür ist geöffnet, bitte schließen Sie die Sicherheitstür!
2=Die Schutztür ist geöffnet, die Markierung ist pausiert, bitte schließen Sie die Schutztür, um mit der Markierung fortzufahren!
3 = Die Sicherheitstür wird geöffnet, die Markierung wird abgebrochen!
4 = Die Schutztür ist geschlossen, Sie können weiter markieren!
5=Die Schutztür ist geschlossen und der Status ist normal!
6=Negativer Grenzwert wird während des Trainings erreicht, Markierung wird abgebrochen!
7 = Während der Bewegung wird der positive Grenzwert erreicht und die Markierung abgebrochen! 
[usb]
1 = EMCC-Karte bereits angeschlossen
2 = Die EMCC-Karte wurde getrennt

[4101]
3=DA-Karte 1 Funktions- und Versionsinformationen
4 = DA-Karte 1 Versionsdatumsinformationen
5 = Verstrichene Zeit der DA-Karte 1
7 = Anzahl der Fehlerbilder für DA-Karte 1
9 = DA-Karte 1 Countdown bis zur 4. Bit-Fehlerzeit
11 = DA-Karte 1 Countdown-Zeit für den 3. Bit-Fehler
13 = DA-Karte 1 Countdown die Zeit des 2. Bitfehlers
15 = Zeitpunkt des letzten Bitfehlers auf DA-Karte 1

[4102]
4 = Anzahl der Out-of-Code-Frames der DA-Karte 1
6 = DA-Karte 1 Countdown die Zeit des 4. Fehlschusses
8 = DA-Karte 1 Countdown die Zeit des 3. verpassten Codes
10 = DA-Karte 1 Countdown die Zeit des zweiten fehlenden Codes
12 = DA-Karte 1 hat die Zeit zuletzt verpasst
14 = DA-Karte 1 Galvanometer-Alarminformationen
15 = DA-Karte 1 Galvanometer-Alarm aus Laser aktivieren

[4103]
3=DA-Karte 2 Funktions- und Versionsinformationen
4 = DA-Karte 2 Versionsdatumsinformationen
5 = Verstrichene Zeit der DA-Karte 2
7 = Anzahl der Fehlerbilder für DA-Karte 2
9 = DA-Karte 2 Countdown-Zeit für den 4. Bitfehler
11 = DA-Karte 2 Countdown-Zeit für den 3. Bit-Fehler
13 = DA-Karte 2 Countdown die Zeit des zweiten Bitfehlers
15 = Zeitpunkt des letzten Bitfehlers auf DA-Karte 2

[4104]
4 = die Anzahl der Out-of-Code-Frames der DA-Karte 2
6 = DA-Karte 2 Countdown bis zum Zeitpunkt des 4. Fehlschusses
8 = DA-Karte 2 Countdown die Zeit des dritten Fehlschusses
10 = DA-Karte 2 vorletzte Verlustzeit
12 = der Zeitpunkt, zu dem die DA-Karte 2 zuletzt verpasst wurde
14 = DA-Karte 2 Galvanometer-Alarminformationen
15 = DA-Karte 2 Galvanometer-Alarm aus Laser aktivieren

[4105]
3 = Informationen zur Funktion und Version der LASER-Karte
4 = Informationen zum Versionsdatum der LASER-Karte
5 = VERSTRICHENE ZEIT DER LASERKARTE
7 = DIE ANZAHL DER FEHLERBILDER FÜR DIE LASERKARTE
9 = Zeitpunkt des vorletzten Bitfehlers der LASER-Karte
11 = Zeitpunkt des vorletzten Bitfehlers der LASER-Karte
13 = Zeit zum Herunterzählen bis zum 2. Bitfehler der LASER-Karte
15 = Zeitpunkt des letzten Bitfehlers auf der LASER-Karte

[4106]
4 = DIE ANZAHL DER VERPASSTEN FRAMES DER LASERKARTE
6 = Die Zeit, in der die LASER-Karte ihren Code für den 4. Countdown verliert
8 = Die Zeit, in der die LASER-Karte den Code für den 3. Countdown verliert
10 = Der Zeitpunkt, zu dem die LASER-Karte den Code zum vorletzten Mal verliert
12 = Zuletzt verpasster Code der LASER-Karte
14=LASER-Galvanometer-Alarmmeldung
15 = LASER-Karten-Laseralarm aus Laser-Freigabe

[4107]
3 = LASER-Karte Laserstrom ns-Wellenform
4 = LASERKARTE Laserstrom ps Wellenform
5 = LASERKARTE laser strom fs wellenform
6 = LASER-Kartenlaser hält derzeit die Stromversorgung aufrecht

[4102Warning]
0=D0: DA-Karte 1 Datenkommunikation abnormal
1=D1: DA-Karte 1 Alarm des Scannersystems
2 = D2: DA-Karte 1 Scanner-Temperaturalarm
3 = D3: DA-Karte 1 Scanner Alarm bei niedriger Geschwindigkeit
4=D4: Nicht belegt
5=D5: Nicht belegt
6=D6: Nicht belegt
7=D7: Nicht belegt
8=D8: Nicht belegt
9=D9: Nicht belegt
10=D10: Nicht belegt
11=D11: Nicht belegt
12=D12: Nicht belegt
13=D13: Nicht belegt
14=D14: Nicht belegt
15=D15: EMCC-Karte Datenkommunikation abnormal

[4104Warning]
0=D0: DA-Karte 2 Datenkommunikation nicht normal
1 = D1: DA-Karte 2 Alarm des Scannersystems
2=D2: DA-Karte 2 Scanner-Temperaturalarm
3 = D3: DA-Karte 2 Scanner-Alarm bei niedriger Geschwindigkeit
4=D4: Nicht belegt
5=D5: Nicht belegt
6=D6: Nicht belegt
7=D7: Nicht belegt
8=D8: Nicht belegt
9=D9: Nicht belegt
10=D10: Nicht belegt
11=D11: Nicht belegt
12=D12: Nicht belegt
13=D13: Nicht belegt
14=D14: Nicht belegt
15=D15: Nicht belegt

[4106Warning]
0 = D0: LASER-Kartendatenkommunikation nicht normal
1=D1: Laser-Temperaturalarm
2=D2: Stromalarm
3=D3: Systemalarm
4 = D4: Hoher Anti-Alarm
5=D5: Der Laser ist nicht bereit
6=D6: Seed-Laser-Zündung fehlgeschlagen
7=D7: Temperaturalarm des Saatgutlasers
8=D8: MO-Überstromalarm
9=D9: PA-Überstromalarm
10=D10: Kollimator-Alarm
11=D11: Alarm 5 halten
12=D12: Alarm 4 halten
13=D13: Alarm 3 halten
14=D14: Alarm 2 halten
15=D15: Alarm 1 halten

[Refresh]
Interval = 500
